export const texts = {
  '레일리산란': `레일리 산란(Rayleigh scattering)은 빛이나 다른 전자기파가 기체나 미립자에 의해 산란되는 현상을 설명하는 물리학적 현상입니다. 이 산란 현상은 물체 주위의 공기 분자와 작은 입자들로 인해 발생하며, 빛의 색상을 설명하는 데 중요한 역할을 합니다.\n
레일리 산란은 다음과 같은 특징을 갖습니다:\n
파장 길이에 따른 산란: 레일리 산란은 파장의 길이에 따라 발생하는데, 파장의 길이가 더 짧은 빛은 더 강력하게 산란됩니다. 이 현상은 대부분 파란색 빛이 하늘에서 산란되어 우리가 푸른 하늘을 볼 수 있는 이유입니다.\n
미립자 크기와 관련: 레일리 산란은 미립자의 크기에도 영향을 받습니다. 미립자의 크기가 파장 길이와 비슷하거나 더 작을 때 산란이 더 강력하게 나타납니다.\n
색상 분리: 이 산란 현상은 다양한 색상의 빛을 다르게 산란시키므로, 우리는 하늘을 보거나 태양 빛을 관찰할 때 다양한 색상의 빛을 볼 수 있습니다. 이것이 지구의 하늘이 푸른색이며, 일몰 또는 일출 시 태양이 주홍색이나 주황색으로 보이는 이유입니다.\n
레일리 산란은 빛의 성질을 이해하고, 분광학 및 기상학 등의 분야에서 중요한 역할을 합니다. 이러한 현상은 물체가 어떻게 볼 때 빛의 색상이 다르게 나타나는지 이해하는 데 중요하며, 특히 태양광 스펙트럼의 이해와 구름, 대기, 먼지 등이 빛을 어떻게 산란시키는지에 대한 연구에 적용됩니다.\n
`,
  '자이가르닉': `자이가르닉 효과(영어: Zeigarnik effect)는 인지심리학에서 관찰되는 현상으로, 미완료된 작업 또는 과제가 미완료 상태로 남아 있는 경우 사람들이 그것을 계속해서 생각하거나 기억하려는 현상을 설명합니다. 이 현상은 소비자 행동, 학습, 기억, 스트레스, 동기 부여 등 다양한 심리적 측면에서 연구되어왔습니다.\n
자이가르닉 효과의 이름은 러시아 심리학자 블루마 자이가르닉 (Bluma Zeigarnik)에 의해 처음 발견되었으며, 그녀가 카페에서 주문이 끝나지 않은 고객의 요청을 기억할 능력에 주목한 것에서 비롯되었습니다. 자이가르닉은 실험에서, 미완료된 과제에 대한 기억이 미완료되지 않은 과제에 대한 기억보다 뚜렷하게 강렬한 것을 관찰했습니다.\n
자이가르닉 효과는 다음과 같이 요약될 수 있습니다:\n
미완료된 과제 또는 작업은 우리의 주의를 끕니다. 우리는 미완료 상태에 대한 호기심을 가지고 더 자세히 살펴보려고 합니다.\n
이러한 미완료된 과제는 우리의 짧은 기억력에 잔류하며, 우리가 다른 과제에 집중하고 있을 때에도 계속해서 머릿속에 떠올릴 수 있습니다.\n
미완료된 과제가 완료되면, 그러한 과제에 대한 기억은 크게 감소하거나 사라질 수 있습니다.\n
자이가르닉 효과는 효율적인 학습 및 작업 관리를 위한 중요한 개념 중 하나이며, 완료되지 않은 과제에 대한 지속적인 관심은 작업을 마치기 위한 동기부여 요인으로 작용할 수 있습니다. 또한, 마감 기한이 존재하는 작업에서는 이러한 효과가 특히 강조됩니다.\n
`,
  '페르소나': `"페르소나"란 우리가 사회적 상황에서 취하는 역할이나 자아 이미지를 의미하는 개념입니다. 이 용어는 주로 심리학, 사회학, 문학 등 다양한 분야에서 사용됩니다.\n
페르소나는 다양한 상황에서 우리의 행동, 언어, 태도, 및 모습을 형성하는데 영향을 미칩니다. 우리는 다른 사람들과 상호작용할 때 다양한 페르소나를 채택할 수 있으며, 이러한 페르소나는 우리가 특정 상황에서 무엇을 기대하고 어떻게 행동해야 하는지에 대한 사회적 요구에 따라 다를 수 있습니다.\n
페르소나의 개념은 심리학자 칼 구스타프 융 (Carl Gustav Jung)이 처음 도입하였으며, 그는 이를 인격의 다양한 측면을 나타내는 것으로 설명하였습니다. 페르소나는 우리의 진정한 자아와는 다를 수 있으며, 종종 사회적 요구나 기대에 맞춰 형성될 수 있습니다.\n
페르소나의 이해는 개인의 행동과 상호작용, 그리고 자아 인식을 연구하는 데 도움을 줄 수 있으며, 다양한 상황에서 어떻게 행동하고 인식하는지를 이해하는 데 도움이 됩니다.\n
`,
  '비트코인': `블록체인(Blockchain)은 분산 원장 기술로, 데이터를 블록(block)이라 불리는 작은 조각으로 나누고, 이러한 블록들을 암호화 기술을 통해 연결하여 연속적인 체인(chain)을 형성하는 분산 데이터베이스 시스템입니다. 블록체인은 중앙 집중형 중앙기관이나 중개인 없이 데이터를 저장, 관리, 및 검증하는 기술을 제공하며, 주로 암호화폐의 거래 기록을 유지하는 데 사용되지만 다양한 다른 응용 분야에도 확장되고 있습니다.\n
블록체인의 주요 특징과 개념은 다음과 같습니다:\n
분산 원장: 블록체인은 네트워크의 다양한 노드(컴퓨터)에 복제된 원장을 가지고 있어, 중앙 집중형 데이터베이스와는 대조적으로 데이터를 분산하여 저장합니다.\n
블록: 데이터는 작은 단위인 블록에 저장되며, 이 블록은 일정 시간 간격 또는 일정 용량이 채워질 때마다 새로운 블록으로 추가됩니다.\n
연결된 체인: 블록들은 이전 블록의 해시(암호화된 고유 식별자)를 포함하여 연결되어 있어, 데이터의 변조를 방지하고 수정을 감지하는 데 도움을 줍니다.\n
암호화: 데이터는 강력한 암호화 기술을 사용하여 보호되며, 블록체인에 저장된 정보는 거의 변경 불가능합니다.\n
합의 알고리즘: 블록체인 네트워크의 참여자들은 합의 알고리즘을 통해 데이터의 정확성과 무결성을 유지하며, 변경 사항을 승인하고 반영합니다.\n
블록체인은 처음으로 비트코인(Bitcoin)이라는 암호화폐를 지원하기 위해 개발되었으며, 디지털 트랜잭션의 불변성과 신뢰성을 제공하기 위한 목적으로 설계되었습니다. 그러나 이후 블록체인 기술은 금융 분야를 넘어 다양한 분야에서 응용되고 있으며, 스마트 계약, 공급망 관리, 의료, 투표, 부동산 등 다양한 분야에서 중요한 역할을 하고 있습니다. 블록체인은 데이터의 누수, 변경, 불법 접근 등에 대한 보안성을 제고하고, 중개없이 거래를 처리하므로 중개기관을 필요로 하지 않는 것으로도 간주됩니다. 이러한 특성은 금융, 로그ISTICS 등 다양한 분야에서 비즈니스 모델의 혁신을 이끌어내고 있습니다\n
`,
  '블록체인': `블록체인(Blockchain)은 분산 원장 기술로, 데이터를 블록(block)이라 불리는 작은 조각으로 나누고, 이러한 블록들을 암호화 기술을 통해 연결하여 연속적인 체인(chain)을 형성하는 분산 데이터베이스 시스템입니다. 블록체인은 중앙 집중형 중앙기관이나 중개인 없이 데이터를 저장, 관리, 및 검증하는 기술을 제공하며, 주로 암호화폐의 거래 기록을 유지하는 데 사용되지만 다양한 다른 응용 분야에도 확장되고 있습니다.\n
블록체인의 주요 특징과 개념은 다음과 같습니다:\n
분산 원장: 블록체인은 네트워크의 다양한 노드(컴퓨터)에 복제된 원장을 가지고 있어, 중앙 집중형 데이터베이스와는 대조적으로 데이터를 분산하여 저장합니다.\n
블록: 데이터는 작은 단위인 블록에 저장되며, 이 블록은 일정 시간 간격 또는 일정 용량이 채워질 때마다 새로운 블록으로 추가됩니다.\n
연결된 체인: 블록들은 이전 블록의 해시(암호화된 고유 식별자)를 포함하여 연결되어 있어, 데이터의 변조를 방지하고 수정을 감지하는 데 도움을 줍니다.\n
암호화: 데이터는 강력한 암호화 기술을 사용하여 보호되며, 블록체인에 저장된 정보는 거의 변경 불가능합니다.\n
합의 알고리즘: 블록체인 네트워크의 참여자들은 합의 알고리즘을 통해 데이터의 정확성과 무결성을 유지하며, 변경 사항을 승인하고 반영합니다.\n
블록체인은 처음으로 비트코인(Bitcoin)이라는 암호화폐를 지원하기 위해 개발되었으며, 디지털 트랜잭션의 불변성과 신뢰성을 제공하기 위한 목적으로 설계되었습니다. 그러나 이후 블록체인 기술은 금융 분야를 넘어 다양한 분야에서 응용되고 있으며, 스마트 계약, 공급망 관리, 의료, 투표, 부동산 등 다양한 분야에서 중요한 역할을 하고 있습니다. 블록체인은 데이터의 누수, 변경, 불법 접근 등에 대한 보안성을 제고하고, 중개없이 거래를 처리하므로 중개기관을 필요로 하지 않는 것으로도 간주됩니다. 이러한 특성은 금융, 로그ISTICS 등 다양한 분야에서 비즈니스 모델의 혁신을 이끌어내고 있습니다\n
`,
  '리소좀': `리소좀(Lysosome)은 동물 세포 내에서 발견되는 작고 주요한 세포 기관 중 하나입니다. 리소좀은 주로 소화 및 분해 기능을 수행하며, 세포 내에서 여러 가지 중요한 생물학적 작용을 조절합니다.\n
리소좀의 주요 기능과 특징은 다음과 같습니다:\n
소화: 리소좀은 세포 내에서 다양한 종류의 물질을 분해하고 소화하는 역할을 합니다. 이러한 물질은 외부로부터 세포 내로 흡수된 물질, 오래된 세포 구성 요소, 세포의 자체 구조, 박테리아, 바이러스 등이 포함됩니다.\n
셀프 다이제스트: 리소좀은 자신의 내부 구성물을 소화할 수 있는 효소를 포함하고 있습니다. 이것은 불필요한 물질 또는 손상된 세포 구성 요소를 소화하여 제거하고, 세포 내에서 중요한 물질을 회수하는 역할을 합니다. 이를 "셀프 다이제스트"라고도 합니다.\n
폐기물 처리: 리소좀은 세포 내에서 생성되는 폐기물을 처리하고 제거함으로써 세포의 정상적인 기능을 유지합니다.\n
소포체로부터의 물질 수송: 리소좀은 소포체(vacuole)로부터 물질을 수송하는 역할도 할 수 있으며, 이러한 기능은 세포의 대사와 혈소판의 역할에 중요합니다.\n
저해 및 보호: 리소좀 내의 효소는 미생물에 대한 방어 역할을 수행하며, 세포 내에서 위험한 외부 성분을 처리하는 데 도움이 됩니다.\n
리소좀은 세포 내에서 매우 중요한 역할을 하며, 세포의 생존과 정상적인 기능을 유지하는 데 필수적입니다. 이러한 이유로 리소좀이 이해와 연구의 대상이 되고, 세포 생물학 및 의학 분야에서 중요한 주제 중 하나입니다.\n
`,
}